app/controllers/api/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    @players = Player.all

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "players" SET "lifetime_wins" = $1 WHERE "players"."id" = $2  [["lifetime_wins", 1], ["id", 1]]
---
  def update

    @player = Player.find_by(id: params[:id])
    @player.lifetime_wins += 1
    @player.update(player_params)